// release-plan/data/holidays.ts

export interface Holiday {
  date: string // формат: "YYYY-MM-DD"
  name: string
}

// 📅 Список официальных праздников РК (дополняется при необходимости)
export const holidays: Holiday[] = [
  { date: "2026-03-08", name: "Международный женский день" },
  { date: "2026-03-21", name: "Наурыз мейрамы" },
  { date: "2026-05-01", name: "Праздник единства народа" },
  { date: "2026-05-07", name: "День защитников Отечесмтва" },
  { date: "2026-05-09", name: "День Победы" },
  { date: "2026-06-06", name: "Курбан-айта" },
  { date: "2026-07-06", name: "День Столицы" },
  { date: "2026-07-07", name: "День Столицы" },
  { date: "2026-09-01", name: "1 Сентября" },
  { date: "2026-10-27", name: "День республики" },
  { date: "2026-12-16", name: "День Независимости" },
  { date: "2026-01-07", name: "Рождество" },
  // { date: "2025-XX-XX", name: "Дополнительно по графику" }
]
